kono123/iam/lib/fs/interfaces/lpc2000_mci.c
/*****************************************************************************\
*              efs - General purpose Embedded Filesystem library              *
*          --------------------- -----------------------------------          *
*                                                                             *
* Filename : lpc2000_mci.c                                                    *
* Description : This file contains the functions needed to use efs for        *
*               accessing files on an SD-card connected to an LPC2368 or      *
*               LPC2378 through the dedicated SD/MMC interface (it might      *
*               even work on LPC24xx, LPC208xx and LPC3180).                   *
*                                                                             *
* This program is free software; you can redistribute it and/or               *
* modify it under the terms of the GNU General Public License                 *
* as published by the Free Software Foundation; version 2                     *
* of the License.                                                             *
*                                                                             *
* This program is distributed in the hope that it will be useful,             *
* but WITHOUT ANY WARRANTY; without even the implied warranty of              *
* MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the               *
* GNU General Public License for more details.                                *
*                                                                             *
* As a special exception, if other files instantiate templates or             *
* use macros or inline functions from this file, or you compile this          *
* file and link it with other works to produce a work based on this file,     *
* this file does not by itself cause the resulting work to be covered         *
* by the GNU General Public License. However the source code for this         *
* file must still be made available in accordance with section (3) of         *
* the GNU General Public License.                                             *
*                                                                             *
* This exception does not invalidate any other reasons why a work based       *
* on this file might be covered by the GNU General Public License.            *
*                                                                             *
*                                                    (c)2007 Juri Haberland   *
\*****************************************************************************/

/* minor modifications from Martin Thomas:
	- volatiles for delay-loop counters
	- format-specifiers %.8X -> %08x
	- helper function -> static
	- FIFO read/write from/to unaligned buffer
	- option for extended debugging-outputs only in this module
*/
 
// #define DEBUG_MCI
#define TEST_MTHOMAS

#ifdef DEBUG_MCI
#define DBGMCI DBG
#else
#define DBGMCI(x__) ;
#endif
 
/*****************************************************************************/
/* #include <LPC23xx.H> */
#include "interfaces/LPC2000_regs.h"
#include "config.h"
#include "extract.h"
#include "interfaces/lpc2000_mci.h"
#include "interfaces/mmc.h"
/*****************************************************************************/

esint8 if_initInterface(hwInterface * card, eint8 * opts)
{
    euint32 card_size;

    if_mci_init();

    if (mci_card_init(card) < 0) {
        DBG((TXT("Card failed to init, giving up.\n")));
        return(EFSL_ERR_FAIL);
    }

    if (mci_get_disk_size(card, &card_size) == 0) {
        card->sectorCount = card_size / DISK_SECTOR_SIZE;
    } else {
        /* getting disk size failed */
        card->sectorCount = 0;
    }
    
	switch (card->type) {
        case CARD_TYPE_MMC:
            DBG((TXT("MMC ")));
			break;
        case CARD_TYPE_SDSC:
			DBG((TXT("SDSC ")));
			break;
        case CARD_TYPE_SDHC:
            DBG((TXT("SDHC ")));
			break;
        default:
            DBG((TXT("Unknown card")));
            break;
    }
	DBG((TXT("card size: %u bytes, sector count: %u\n"), card_size, card->sectorCount));

    DBG((TXT("Init done.\n")));
    return(EFSL_ERR_OK);
}
/*****************************************************************************/

esint8 if_readBuf(hwInterface * card, euint32 block_no, euint8 * buf)
{
    return(mci_read_block(card, block_no, buf));
}
/*****************************************************************************/

esint8 if_writeBuf(hwInterface * card, euint32 block_no, euint8 * buf)
{
    return(mci_write_block(card, block_no, buf));
}
/*****************************************************************************/


/**********************************************************
 * name:       mci_sendcmd()
 **********************************************************
 * sends a MMC command to the card
 ********************************************************** 
 * arguments:  MMC command, argument to command, flags for
 *             command
 * return val: status
 **********************************************************/
static euint32 mci_sendcmd(euint16 cmd, euint32 arg, euint32 flags)
{
    euint32 status;
    volatile euint32 count;

    /* always enable the command path state machine */
    cmd |= MMC_CMD_ENABLE_CPSM;

    /* merge the flags with the command */
    cmd |= flags;

    /* write argument into argument register */
    MCI_ARGUMENT = arg;

    /* send command and (roughly) wait 3x MCLK + 2x PCLK periods */
    MCI_COMMAND = cmd;
    for (count = TIME_OUT_VAL; count > 0; count--);

    /* wait for completion, response, timeout, error... */
    do {
        status = MCI_STATUS;
    } while (status & MCI_STAT_CMD_ACTIVE);

    /* clear all resetable status flags */
    MCI_CLEAR = MCI_STATUS_CLEAR_MASK;

    return(status);
}


/**********************************************************
 * name:       if_mci_init()
 **********************************************************
 * initializes the MCI hardware
 ********************************************************** 
 * arguments:  none
 * return val: none
 **********************************************************/
void if_mci_init(void)
{
    volatile euint32 count;  /* used in for-loops */

