kono123/iam/lib/fs/interfaces/lpc2000_mci.c
    DBGMCI((TXT("init started\n")));

    /* enable the SD/MMC card interface pins */
    PINSEL1 = (PINSEL1 & ~0x00003FC0) | 0x00002A80;
    PINSEL4 = (PINSEL4 & ~0x0FC00000) | 0x0A800000;

    /* enable the power and clock of the SD/MMC card interface */
    PCONP |= 0x10000000;

    /* reset command register and data control register */
    MCI_COMMAND = 0;
    MCI_DATA_CTRL = 0;
    /* clear all status bits */
    MCI_CLEAR = MCI_STATUS_CLEAR_MASK;

    /* in case power was on, turn it off and reset bus mode and Rod to push-pull mode */
    MCI_POWER = MMC_POWER_OFF;
    for (count = 5000; count > 0; count--);

    /* enable power to the SD card, wait for the power to stabilize */
    MCI_POWER |= MMC_POWER_UP;
    while (!(MCI_POWER & MMC_POWER_UP));
    /* wait at least 1us (cclk = 57,6MHz) */
    for (count = TIME_OUT_VAL; count > 0; count--);

    /* set clock to 400kHz, enable MCI bus clock, disable clock if bus is idle, no bypass, no wide bus */
    MCI_CLOCK = MCI_CLK_ENABLE | MCI_CLK_PWRSAVE | MCI_CLK_DIV_LOW_SPEED;
    for (count = 2400; count > 0; count--);

    MCI_POWER |= MMC_POWER_ON;
    for (count = 50000; count > 0; count--);

    DBGMCI((TXT("init done\n")));
}


/**********************************************************
 * name:       mci_card_init()
 **********************************************************
 * initializes the MMC card
 ********************************************************** 
 * arguments:  pointer to interface structure
 * return val: status
 **********************************************************/
esint8 mci_card_init(hwInterface * card)
{
    volatile euint32 count;
	euint32 status;
    euint32 response;
    euint32 cmd41_arg;

    DBGMCI((TXT("card init started\n")));
    card->type = CARD_TYPE_UNKNOWN;

    /* start card identification mode */

    /* reset card */
    /* send CMD0 */
    status = mci_sendcmd(MMC_GO_IDLE_STATE, 0, MMC_CMD_NO_RESPONSE);
    for (count = 2400; count > 0; count--);
    if (status & MCI_STAT_CMD_TIMEOUT) {
        DBG((TXT("Timeout CMD0  status:   0x%08x\n"), status));
    }

    /* set push-pull bus mode for SD cards and disable Rod */
    MCI_POWER &= ~(MMC_BUS_MODE_OPEN_DRAIN | MMC_BUS_MODE_ROD);
    for (count = TIME_OUT_VAL; count > 0; count--);

    /* initialization for SD cards >= v2.00 - *must* be done first! */
    /* send power range (2.7 - 3.6V) to card; may time out if:
       - card cannot operate within the power range or
       - card does not understand CMD8 (MMC and pre-v2.00 SD cards) */
    /* send CMD8 */
    status = mci_sendcmd(SD_SEND_IF_COND, 0x000001AA, MMC_CMD_RESPONSE);
    if (status & MCI_STAT_CMD_TIMEOUT) {
        /* not a SD card >= v2.00, so don't check for high capacity */
        cmd41_arg = MMC_OCR_HIGH_VOLTAGE_RANGE;
		DBGMCI((TXT("not a SD-CARD >= V2.00\n")));
        DBGMCI((TXT("Timeout CMD8  status:   0x%08x\n"), status));
    } else {
        /* no timeout, this must be a SD card >= v2.00, so check for high capacity */
        card->type = CARD_TYPE_SDV2;
        cmd41_arg = MMC_OCR_CARD_HIGH_CAPACITY | MMC_OCR_HIGH_VOLTAGE_RANGE;
    }

    /* another check for the cards power range - this works also for older SD cards */
    /* send power range (2.7 - 3.6V) to card; may time out if:
       - card cannot not operate within the power range or
       - card does not understand ACMD41 (MMC cards) */
    count = TIME_OUT_VAL;
    do {
        /* send CMD55 */
        mci_sendcmd(MMC_APP_CMD, 0, MMC_CMD_RESPONSE);
        /* send ACMD41 */
        status = mci_sendcmd(SD_APP_OP_COND, cmd41_arg, MMC_CMD_RESPONSE);
        response = MCI_RESP0;
    } while (!(status & MCI_STAT_CMD_TIMEOUT) && !(response & MMC_OCR_CARD_NOT_BUSY) && --count);

    if ((status & MCI_STAT_CMD_TIMEOUT) || (count == 0)) {
        /* CMD55/ACMD41 timed out - so it's either:
         - a MMC card
         - a SD card with incompatible power range
         - or no card at all */
		DBG((TXT("Timeout ACMD41 (-> a MMC, SD with incomp. power-range or no card)\n")));
        DBG((TXT("ACMD41 count:    %i\n"), TIME_OUT_VAL - count));
        DBG((TXT("ACMD41 status:   0x%08x\n"), status));
        DBG((TXT("ACMD41 Response: 0x%08x\n"), response));

        /* set open drain bus mode and enable Rod for MMC card initialization */
        MCI_POWER |= MMC_BUS_MODE_OPEN_DRAIN | MMC_BUS_MODE_ROD;
        for (count = TIME_OUT_VAL; count > 0; count--);

        count = TIME_OUT_VAL;
        do {
            /* send CMD1 */
            status = mci_sendcmd(MMC_SEND_OP_COND, MMC_OCR_HIGH_VOLTAGE_RANGE, MMC_CMD_RESPONSE);
            response = MCI_RESP0;
        } while (!(status & MCI_STAT_CMD_TIMEOUT) && !(response & MMC_OCR_CARD_NOT_BUSY) && --count);

        if ((status & MCI_STAT_CMD_TIMEOUT) || (count == 0)) {
            /* no card */
			DBG((TXT(" Timeout CMD1\n")));
            DBG((TXT(" CMD1  count:    %i\n"), TIME_OUT_VAL - count));
            DBG((TXT(" CMD1  status:   0x%08x\n"), status));
            DBG((TXT(" CMD1  Response: 0x%08x\n"), response));
            return(EFSL_ERR_FAIL);
        } else {
            /* it's a MMC card - finally */
            card->type = CARD_TYPE_MMC;
        }
    } else {
        /* it's a SD card */
        if (response & MMC_OCR_CARD_HIGH_CAPACITY) {
            card->type |= CARD_TYPE_SDHC;
        } else {
            card->type |= CARD_TYPE_SDSC;
        }            
    }

    /* send CMD2 */
    status = mci_sendcmd(MMC_ALL_SEND_CID, 0, MMC_CMD_RESPONSE | MMC_CMD_LONGRSP);
    if (status != MCI_STAT_CMD_RESP_END) {
        DBG((TXT("No CMD_RESP_END CMD2  status:   0x%08x\n"), status));
        return(EFSL_ERR_FAIL);
    }

    /* send CMD3 */
    if (card->type & CARD_TYPE_MMC) {
        /* MMC cards need the RCA to be set by the host */
        status = mci_sendcmd(MMC_SET_RELATIVE_ADDR, MMC_CARD_ADDRESS, MMC_CMD_RESPONSE);
        /* expect a short answer of type R1 */
    } else {
        /* it's a SD card, so just query the RCA from the card */
        status = mci_sendcmd(SD_SEND_RELATIVE_ADDR, 0, MMC_CMD_RESPONSE);
        /* expect a short answer of type R6 (including the RCA of the card) */
    }
    if (status == MCI_STAT_CMD_RESP_END) {
        if (card->type & CARD_TYPE_MMC) {
            /* MMC: we assigned the address */
            card->address = MMC_CARD_ADDRESS;
        } else {
            /* SD: we got the address from the card */
            card->address = MCI_RESP0 & 0xFFFF0000;
        }
    } else {
        DBG((TXT("No CMD_RESP_END CMD3  status:   0x%08x\n"), status));
        return(EFSL_ERR_FAIL);
    }

    /* set clock to 14.4MHz, enable MCI bus clock, disable clock if bus is idle, no bypass, no wide bus */
    switch (card->type) {
        case CARD_TYPE_MMC:
            /* fmax is 20 MHz */
            MCI_CLOCK = MCI_CLK_ENABLE | MCI_CLK_PWRSAVE | MCI_CLK_DIV_HIGH_SPEED;
            for (count = TIME_OUT_VAL; count > 0; count--);
            /* set push-pull bus mode and disable Rod */
            MCI_POWER &= ~(MMC_BUS_MODE_OPEN_DRAIN | MMC_BUS_MODE_ROD);
            for (count = TIME_OUT_VAL; count > 0; count--);
            break;
        case CARD_TYPE_SDSC:
        case CARD_TYPE_SDHC:
            /* fmax is 25 MHz */
            MCI_CLOCK = MCI_CLK_ENABLE | MCI_CLK_PWRSAVE | MCI_CLK_DIV_HIGH_SPEED;
            for (count = TIME_OUT_VAL; count > 0; count--);
            break;
        default:
            /* unkown card - we stay at 400kHz */
            break;
    }

    DBGMCI((TXT("card init done\n")));

    /* end of initialization */
    return(EFSL_ERR_OK);
}


/**********************************************************
 * name:       mci_get_disk_size()
 **********************************************************
 * calculates the disk size from special registers on the
 * MMC card
 ********************************************************** 
 * arguments:  pointer to interface structure, pointer to
 *             32bit unsigned int which will be filled with
 *             disk size
 * return val: status: 0 on success
 **********************************************************/
euint8 mci_get_disk_size(hwInterface * card, euint32 * card_size)
{
    euint32 status;
    euint8 c_size_mult;
    euint16 c_size;
    euint16 read_bl_len;
    esint8 retval;

    DBGMCI((TXT("get_disk_size started\n")));

