kono123/iam/lib/fs/interfaces/lpc2000_mci.c
    /* get CSD register from card (CMD9) */
    status = mci_sendcmd(MMC_SEND_CSD, card->address, MMC_CMD_RESPONSE | MMC_CMD_LONGRSP);

    if (status == MCI_STAT_CMD_RESP_END) {
        /* ok, response received */
        /* extract the values from the response */
        read_bl_len = (MCI_RESP1 & 0x000F0000) >> 16;
        c_size = (MCI_RESP1 & 0x000003FF) << 2;
        c_size |= (MCI_RESP2 & 0xC0000000) >> 30;
        c_size_mult = (MCI_RESP2 & 0x00038000) >> 15;
        /* for formula see SD Specification Part 1: Physical Layer V2.00, p. 81 */
        *card_size = (1 << read_bl_len) * (c_size + 1) * (1 << (c_size_mult + 2));
        retval = 0;
    } else {
        /* bad, something went wrong */
        DBG((TXT("No CMD_RESP_END CMD9  status:   0x%08x\n"), status));
        *card_size = 0;
        retval = -1;
    }

    DBGMCI((TXT("get_disk_size done\n")));

    return(retval);
}


/**********************************************************
 * name:       mci_block_read()
 **********************************************************
 * reads the block with the given block number into the
 * given buffer; a block is always 512 bytes in size,
 * therefore the buffer must also be 512 bytes in size
 ********************************************************** 
 * arguments:  pointer to interface structure, block number,
 *             pointer to a 512 bytes buffer
 * return val: status: 0 on success
 **********************************************************/
esint8 mci_read_block(hwInterface * card, euint32 block_no, euint8 * buf)
{
    euint32 status;
    euint32 response;
    volatile euint32 count = 0;
	
    DBGMCI((TXT("read sector: %u\n"), block_no));

    /* select card for further usage (CMD7) */
    status = mci_sendcmd(MMC_SELECT_CARD, card->address, MMC_CMD_RESPONSE);
    if (status != MCI_STAT_CMD_RESP_END) {
		DBG((TXT(" No CMD_RESP_END CMD7\n")));
        DBG((TXT(" CMD7  status:   0x%08x\n"), status));
        DBG((TXT(" CMD7  Response: 0x%08x\n"), MCI_RESP0));
        return(EFSL_ERR_FAIL);
    }

    /* if it is a SD card, turn on 4bit modus */
    /* this needs DMA support, as the processor is not fast enough to */
//    if ((card->type == CARD_TYPE_SDSC) || (card->type == CARD_TYPE_SDHC)) {
//        /* configure MCI host adapter for 4bit modus */
//        MCI_CLOCK |= MCI_CLK_WIDE_BUS;
//        for (count = TIME_OUT_VAL; count > 0; count--);
//        /* send CMD55 */
//        mci_sendcmd(MMC_APP_CMD, card->address, MMC_CMD_RESPONSE);
//        /* send ACMD6 */
//        status = mci_sendcmd(SD_APP_SET_BUS_WIDTH, MMC_BUS_WIDTH_4_BIT, MMC_CMD_RESPONSE);
//        if (status != MCI_STAT_CMD_END) {
//            DBGMCI((TXT("ACMD6  status:   0x%08x\n"), status));
//            DBGMCI((TXT("ACMD6  Response: 0x%08x\n"), MCI_RESP0));
//        }
//    }

    /* prepare data transfer */
    /* set data read timeout */
    MCI_DATA_TMR = 0x00100000;
    /* set amount of data to be received */
    MCI_DATA_LEN = MMC_BLOCK_SIZE;
    /* enable data receiving */
    MCI_DATA_CTRL = MCI_DATA_TRANS_EN | MCI_DATA_TO_HOST | MCI_DATA_BLOCK_MODE | MCI_DATA_BLOCK_SIZE_512;

    /* initiate data read transfer (CMD17) */
    if (card->type == CARD_TYPE_SDHC) {
        /* high capacity SD cards use the block number as address parameter */
        status = mci_sendcmd(MMC_READ_SINGLE_BLOCK, block_no, MMC_CMD_RESPONSE);
    } else {
        /* standard capacity SD cards and MMC cards use the memory address as address parameter */
        status = mci_sendcmd(MMC_READ_SINGLE_BLOCK, block_no * MMC_BLOCK_SIZE, MMC_CMD_RESPONSE);
    }
    if (!(status & MCI_STAT_CMD_RESP_END)) {
		DBG((TXT(" No CMD_RESP_END CMD17 - init read\n")));
        DBG((TXT(" CMD17 status:   0x%08x\n"), status));
        DBG((TXT(" CMD17 Response: 0x%08x\n"), MCI_RESP0));
        return(EFSL_ERR_FAIL);
    }

    /* read the data from the bus and store it in the buffer */
    count = 0;
    do {
        while ((MCI_STATUS & MCI_STAT_RX_DATA_AVLBL) && (count < (MMC_BLOCK_SIZE / sizeof(euint32)))) {
            /* mthomas - alignment: ((euint32 *)buf)[count] = MCI_FIFO; */
			ex_setb32(buf, count*4, MCI_FIFO);
            count++;
        }
    } while (!(MCI_STATUS & (MCI_STAT_DATA_TIMEOUT | MCI_STAT_RX_OVERRUN | MCI_STAT_DATA_END | MCI_STAT_DATA_BLOCK_END)) && (count < (MMC_BLOCK_SIZE / sizeof(euint32))));

    /* did we get the correct number of bytes? */
    if (count != MMC_BLOCK_SIZE / sizeof(euint32)) {
		DBG((TXT("Size mismatch read\n")));
        DBG((TXT("read status:   0x%08x\n"), MCI_STATUS));
        DBG((TXT("read count:    %u\n"), count));
        return(EFSL_ERR_FAIL);
    }
    MCI_CLEAR = MCI_STATUS_CLEAR_MASK;

    /* reset data control register in MCI */
    MCI_DATA_CTRL = 0;
    for (count = TIME_OUT_VAL; count > 0; count--);

    /* get card status (CMD13) */
    status = mci_sendcmd(MMC_SEND_STATUS, card->address, MMC_CMD_RESPONSE);
    response = MCI_RESP0;
    if (response != (MMC_C_S_READY_FOR_DATA | MMC_C_S_STATE_TRAN)) {
		DBG((TXT(" read: only C_S_READY_FOR_DATA |  MMC_C_S_STATE_TRAN expected\n")));
        DBG((TXT(" CMD13 status:   0x%08x\n"), status));
        DBG((TXT(" CMD13 Response: 0x%08x\n"), response));
		DBG((TXT(" trying STOP_TRANSMISSION\n"), response));
        /* something went wrong - try to stop the data transfer (CMD12) */
        mci_sendcmd(MMC_STOP_TRANSMISSION, 0, MMC_CMD_RESPONSE);
        /* get card status again (CMD13) */
        status = mci_sendcmd(MMC_SEND_STATUS, card->address, MMC_CMD_RESPONSE);
        if (!(status & MCI_STAT_CMD_RESP_END)) {
            /* still not good - bail out */
			DBG((TXT(" read: No CMD_RESP_END from STOP_TRANMS\n")));
            DBG((TXT(" CMD13 status:   0x%08x\n"), status));
            DBG((TXT(" CMD13 Response: 0x%08x\n"), MCI_RESP0));
            return(EFSL_ERR_FAIL);
        }
    }

    /* deselect card (CMD7) */
    status = mci_sendcmd(MMC_SELECT_CARD, 0, MMC_CMD_NO_RESPONSE);
    if (!(status & MCI_STAT_CMD_SENT)) {
		DBG((TXT(" read: CMD7 failed\n")));
        DBG((TXT(" CMD7  status:   0x%08x\n"), status));
        DBG((TXT(" CMD7  Response: 0x%08x\n"), MCI_RESP0));
        return(EFSL_ERR_FAIL);
    }

