kono123/iam/lib/fs/interfaces/lpc2000_mci.c
    DBGMCI((TXT("read_sector done\n")));

    return(EFSL_ERR_OK);
}

/**********************************************************
 * name:       mci_block_write()
 **********************************************************
 * writes the block with the given block number from the
 * given buffer; a block is always 512 bytes in size,
 * therefore the buffer must also be 512 bytes in size
 ********************************************************** 
 * arguments:  pointer to interface structure, block number,
 *             pointer to a 512 bytes buffer
 * return val: status: 0 on success
 **********************************************************/
esint8 mci_write_block(hwInterface * card, euint32 block_no, euint8 * buf)
{
    euint32 status;
    euint32 response;
    volatile euint32 count = 0;
	
    DBGMCI((TXT("write sector: %u\n"), block_no));

    /* select card for further usage (CMD7) */
    status = mci_sendcmd(MMC_SELECT_CARD, card->address, MMC_CMD_RESPONSE);
    if (status != MCI_STAT_CMD_RESP_END) {
		DBG((TXT("write: No CMD_RESP_END from SELECT_CARD\n")));
        DBG((TXT("status:   0x%08x\n"), status));
        DBG((TXT("Response: 0x%08x\n"), MCI_RESP0));
        return(EFSL_ERR_FAIL);
    }

    /* if it is a SD card, turn on 4bit modus */
    /* this needs DMA support, as the processor is not fast enough to */
//    if ((card->type == CARD_TYPE_SDSC) || (card->type == CARD_TYPE_SDHC)) {
//        /* configure MCI host adapter for 4bit modus */
//        MCI_CLOCK |= MCI_CLK_WIDE_BUS;
//        for (count = TIME_OUT_VAL; count > 0; count--);
//        /* send CMD55 */
//        mci_sendcmd(MMC_APP_CMD, card->address, MMC_CMD_RESPONSE);
//        /* send ACMD6 */
//        status = mci_sendcmd(SD_APP_SET_BUS_WIDTH, MMC_BUS_WIDTH_4_BIT, MMC_CMD_RESPONSE);
//        if (status != MCI_STAT_CMD_END) {
//            DBGMCI((TXT("ACMD6  status:   0x%08x\n"), status));
//            DBGMCI((TXT("ACMD6  Response: 0x%08x\n"), MCI_RESP0));
//        }
//    }

    /* prepare data transfer */
    /* set data write timeout */
    MCI_DATA_TMR = 0x00100000;
    /* set amount of data to be written */
    MCI_DATA_LEN = MMC_BLOCK_SIZE;
    /* enable data sending */
    MCI_DATA_CTRL = MCI_DATA_TRANS_EN | MCI_DATA_TO_CARD | MCI_DATA_BLOCK_MODE | MCI_DATA_BLOCK_SIZE_512;

    /* initiate data write transfer (CMD24) */
    if (card->type == CARD_TYPE_SDHC) {
        /* high capacity SD cards use the block number as address parameter */
        status = mci_sendcmd(MMC_WRITE_BLOCK, block_no, MMC_CMD_RESPONSE);
    } else {
        /* standard capacity SD cards and MMC cards use the memory address as address parameter */
        status = mci_sendcmd(MMC_WRITE_BLOCK, block_no * MMC_BLOCK_SIZE, MMC_CMD_RESPONSE);
    }
    if (!(status & MCI_STAT_CMD_RESP_END)) {
		DBG((TXT("write: No CMD_RESP_END from CMD24\n")));
        DBG((TXT(" CMD24 status:   0x%08x\n"), status));
        DBG((TXT(" CMD24 Response: 0x%08x\n"), MCI_RESP0));
        return(EFSL_ERR_FAIL);
    }

    /* write the data from the buffer to the bus */
	DBGMCI((TXT("DataTransfer start...")));
    count = 0;
    do {
        while (!(MCI_STATUS & MCI_STAT_TX_FIFO_FULL) && (count < (MMC_BLOCK_SIZE / sizeof(euint32)))) {
            /* mthomas - alignment: MCI_FIFO = ((euint32 *)buf)[count]; */
			MCI_FIFO = ex_getb32( buf, count*4 );
            count++;
        }
    } while (!(MCI_STATUS & (MCI_STAT_DATA_TIMEOUT | MCI_STAT_TX_UNDERRUN | MCI_STAT_DATA_END | MCI_STAT_DATA_BLOCK_END)) && (count < (MMC_BLOCK_SIZE / sizeof(euint32))));
	DBGMCI((TXT("end ")));

#ifdef TEST_MTHOMAS
	if ( MCI_STATUS & MCI_STAT_DATA_TIMEOUT ) {
		DBGMCI((TXT("DATA TIMEOUT ")));
	}
	if ( MCI_STATUS & MCI_STAT_TX_UNDERRUN ) {
		DBGMCI((TXT("TX UNDERRUN ")));
	}
	if ( MCI_STATUS & MCI_STAT_DATA_END ) {
		DBGMCI((TXT("DATA END ")));
	}
	if ( MCI_STATUS & MCI_STAT_DATA_BLOCK_END ) {
		DBGMCI((TXT("DATA BLOCK END ")));
	}
#endif

    /* check if we wrote the correct number of bytes */
    if (count != MMC_BLOCK_SIZE / sizeof(euint32)) {
		DBG((TXT("write: size-mismatch\n")));
        DBG((TXT("write status:   0x%08x\n"), MCI_STATUS));
        DBG((TXT("write count:    %u\n"), count));
        return(EFSL_ERR_FAIL);
    }
    
#ifdef TEST_MTHOMAS
	DBGMCI((TXT("Fifo Data Avail wait start...")));
	count = 0;
    while ( ( MCI_STATUS & MCI_STAT_TX_DATA_AVLBL ) && ( count < TIME_OUT_VAL ) ) {
		count++;
	}
	if ( count == TIME_OUT_VAL ) {
		DBG((TXT("write: Timeout - still FIFO data avail. - but why?\n")));
	}
	DBGMCI((TXT("end ")));
#else
	MCI_CLEAR = MCI_STATUS_CLEAR_MASK;

    /* wait until the FIFO is empty */
	DBGMCI((TXT("Fifo empty wait start...")));
    while (!(MCI_STATUS & MCI_STAT_TX_FIFO_EMPTY)) {
		DBGMCI((TXT(" MCI_STATUS: 0x%08x\n"), MCI_STATUS));
	}
	DBGMCI((TXT("end ")));
#endif
	
    MCI_CLEAR = MCI_STATUS_CLEAR_MASK;
	
    /* wait until the card has processed all data */
	DBGMCI((TXT("WaitProcess start...")));
    count = 0;
    do {
        mci_sendcmd(MMC_SEND_STATUS, card->address, MMC_CMD_RESPONSE);
        response = MCI_RESP0;
        count++;
#ifdef TEST_MTHOMAS
	} while ((response != (MMC_C_S_READY_FOR_DATA | MMC_C_S_STATE_TRAN)) && (count < TIME_OUT_VAL));
	if ( count == TIME_OUT_VAL ) {	
		DBGMCI((TXT("write: timeout waiting for C_S_READY_FOR_DATA | CS_STATE_TRAN\n")));
	}
#else
    } while ((response != (MMC_C_S_READY_FOR_DATA | MMC_C_S_STATE_TRAN)) || (count > TIME_OUT_VAL));
#endif
	DBGMCI((TXT("end ")));

    /* reset data control register */
    MCI_DATA_CTRL = 0;
    for (count = TIME_OUT_VAL; count > 0; count--);

    /* get card status (CMD13) */
    status = mci_sendcmd(MMC_SEND_STATUS, card->address, MMC_CMD_RESPONSE);
    response = MCI_RESP0;
    if (response != (MMC_C_S_READY_FOR_DATA | MMC_C_S_STATE_TRAN)) {
		DBGMCI((TXT(" write: status != MMC_C_S_READY_FOR_DATA | MMC_C_S_STATE_TRAN\n")));
        DBGMCI((TXT(" CMD13 status:   0x%08x\n"), status));
        DBGMCI((TXT(" CMD13 Response: 0x%08x\n"), response));
		DBGMCI((TXT(" trying STOP_TRANSMISSION\n")));
        /* something went wrong - try to stop the data transfer (CMD12) */
        mci_sendcmd(MMC_STOP_TRANSMISSION, 0, MMC_CMD_RESPONSE);
        /* get card status again (CMD13) */
        status = mci_sendcmd(MMC_SEND_STATUS, card->address, MMC_CMD_RESPONSE);
        if (!(status & MCI_STAT_CMD_RESP_END)) {
            /* still not good - bail out */
			DBG((TXT(" write: STOP_TRANSMISSION failed\n")));
            DBG((TXT(" CMD13 status:   0x%08x\n"), status));
            DBG((TXT(" CMD13 Response: 0x%08x\n"), MCI_RESP0));
            return(EFSL_ERR_FAIL);
        }
    }

    /* deselect card (CMD7) */
    status = mci_sendcmd(MMC_SELECT_CARD, 0, MMC_CMD_NO_RESPONSE);
    if (!(status & MCI_STAT_CMD_SENT)) {
		DBG((TXT(" write: DESELECT failed\n")));
        DBG((TXT(" CMD7  status:   0x%08x\n"), status));
        DBG((TXT(" CMD7  Response: 0x%08x\n"), MCI_RESP0));
        return(EFSL_ERR_FAIL);
    }

    DBGMCI((TXT("write_sector done\n")));

    return(EFSL_ERR_OK);
}
